QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_sdfm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the SDDFPARM3 register
//
//*************************************************************************************************
#define SDFM_SDDFPARM3_DOSR_S   0U
#define SDFM_SDDFPARM3_DOSR_M   0xFFU  // Data Filter Oversample Ratio= DOSR+1
#define SDFM_SDDFPARM3_FEN      0x100U // Filter Enable
#define SDFM_SDDFPARM3_AE       0x200U // Ack Enable
#define SDFM_SDDFPARM3_SST_S    10U
#define SDFM_SDDFPARM3_SST_M    0xC00U  // Data filter Structure (SincFast/1/2/3)
#define SDFM_SDDFPARM3_SDSYNCEN 0x1000U // Data Filter Reset Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDDPARM3 register
//
//*************************************************************************************************
#define SDFM_SDDPARM3_DR   0x400U // Data Representation (0/1 = 16/32b 2's complement)
#define SDFM_SDDPARM3_SH_S 11U
#define SDFM_SDDPARM3_SH_M 0xF800U // Shift Control (# bits to shift in 16b mode)

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCMPH3 register
//
//*************************************************************************************************
#define SDFM_SDCMPH3_HLT_S 0U
#define SDFM_SDCMPH3_HLT_M 0x7FFFU // High-level threshold for the comparator filter output

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCMPL3 register
//
//*************************************************************************************************
#define SDFM_SDCMPL3_LLT_S 0U
#define SDFM_SDCMPL3_LLT_M 0x7FFFU // Low-level threshold for the comparator filter output

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCPARM3 register
//
//*************************************************************************************************
#define SDFM_SDCPARM3_COSR_S    0U
#define SDFM_SDCPARM3_COSR_M    0x1FU // Comparator Oversample Ratio. Actual rate COSR+1
#define SDFM_SDCPARM3_IEH       0x20U // High-level Interrupt enable.
#define SDFM_SDCPARM3_IEL       0x40U // Low-level interrupt enable
#define SDFM_SDCPARM3_CS1_CS0_S 7U
#define SDFM_SDCPARM3_CS1_CS0_M 0x180U  // Comparator Filter Structure (SincFast/1/2/3)
#define SDFM_SDCPARM3_MFIE      0x200U  // Modulator Failure Interrupt enable
#define SDFM_SDCPARM3_HZEN      0x400U  // High level (Z) Threshold crossing output enable
#define SDFM_SDCPARM3_CEN       0x2000U // Comparator Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDDATA3 register
//
//*************************************************************************************************
#define SDFM_SDDATA3_DATA16_S   0U
#define SDFM_SDDATA3_DATA16_M   0xFFFFU // Lo-order 16b in 32b mode
#define SDFM_SDDATA3_DATA32HI_S 16U
#define SDFM_SDDATA3_DATA32HI_M \
    0xFFFF0000U // Hi-order 16b in 32b mode, 16-bit Data in 16b
                // mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDDATFIFO3 register
//
//*************************************************************************************************
#define SDFM_SDDATFIFO3_DATA16_S   0U
#define SDFM_SDDATFIFO3_DATA16_M   0xFFFFU // Lo-order 16b in 32b mode
#define SDFM_SDDATFIFO3_DATA32HI_S 16U
#define SDFM_SDDATFIFO3_DATA32HI_M \
    0xFFFF0000U // Hi-order 16b in 32b mode, 16-bit Data in 16b
                // mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCMPHZ3 register
//
//*************************************************************************************************
#define SDFM_SDCMPHZ3_HLTZ_S 0U
#define SDFM_SDCMPHZ3_HLTZ_M \
    0x7FFFU // High-level threshold (Z) for the comparator filter
            // output

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDFIFOCTL3 register
//
//*************************************************************************************************
#define SDFM_SDFIFOCTL3_SDFFIL_S 0U
#define SDFM_SDFIFOCTL3_SDFFIL_M 0x1FU // SDFIFO Interrupt Level
#define SDFM_SDFIFOCTL3_SDFFST_S 6U
#define SDFM_SDFIFOCTL3_SDFFST_M 0x7C0U  // SDFIFO Status
#define SDFM_SDFIFOCTL3_FFIEN    0x1000U // SDFIFO data ready Interrupt Enable
#define SDFM_SDFIFOCTL3_FFEN     0x2000U // SDFIFO Enable
#define SDFM_SDFIFOCTL3_DRINTSEL 0x4000U // Data-Ready Interrupt Source Select
#define SDFM_SDFIFOCTL3_OVFIEN   0x8000U // SDFIFO Overflow interrupt enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDSYNC3 register
//
//*************************************************************************************************
#define SDFM_SDSYNC3_SYNCSEL_S   0U
#define SDFM_SDSYNC3_SYNCSEL_M   0x3FU  // SDSYNC Source Select
#define SDFM_SDSYNC3_WTSYNCEN    0x40U  // Wait-for-Sync Enable
#define SDFM_SDSYNC3_WTSYNFLG    0x80U  // Wait-for-Sync Flag
#define SDFM_SDSYNC3_WTSYNCLR    0x100U // Wait-for-Sync Flag Clear
#define SDFM_SDSYNC3_FFSYNCCLREN 0x200U // FIFO Clear-on-SDSYNC Enable
#define SDFM_SDSYNC3_WTSCLREN    0x400U // WTSYNFLG Clear-on-FIFOINT Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCTLPARM4 register
//
//*************************************************************************************************
#define SDFM_SDCTLPARM4_MOD_S 0U
#define SDFM_SDCTLPARM4_MOD_M 0x3U // Modulator clocking modes

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDDFPARM4 register
//
//*************************************************************************************************
#define SDFM_SDDFPARM4_DOSR_S   0U
#define SDFM_SDDFPARM4_DOSR_M   0xFFU  // Data Filter Oversample Ratio= DOSR+1
#define SDFM_SDDFPARM4_FEN      0x100U // Filter Enable
#define SDFM_SDDFPARM4_AE       0x200U // Ack Enable
#define SDFM_SDDFPARM4_SST_S    10U
#define SDFM_SDDFPARM4_SST_M    0xC00U  // Data filter Structure (SincFast/1/2/3)
#define SDFM_SDDFPARM4_SDSYNCEN 0x1000U // Data Filter Reset Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDDPARM4 register
//
//*************************************************************************************************
#define SDFM_SDDPARM4_DR   0x400U // Data Representation (0/1 = 16/32b 2's complement)
#define SDFM_SDDPARM4_SH_S 11U
#define SDFM_SDDPARM4_SH_M 0xF800U // Shift Control (# bits to shift in 16b mode)

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCMPH4 register
//
//*************************************************************************************************
#define SDFM_SDCMPH4_HLT_S 0U
#define SDFM_SDCMPH4_HLT_M 0x7FFFU // High-level threshold for the comparator filter output

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCMPL4 register
//
//*************************************************************************************************
#define SDFM_SDCMPL4_LLT_S 0U
#define SDFM_SDCMPL4_LLT_M 0x7FFFU // Low-level threshold for the comparator filter output

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCPARM4 register
//
//*************************************************************************************************
#define SDFM_SDCPARM4_COSR_S    0U
#define SDFM_SDCPARM4_COSR_M    0x1FU // Comparator Oversample Ratio. Actual rate COSR+1
#define SDFM_SDCPARM4_IEH       0x20U // High-level Interrupt enable.
#define SDFM_SDCPARM4_IEL       0x40U // Low-level interrupt enable
#define SDFM_SDCPARM4_CS1_CS0_S 7U
#define SDFM_SDCPARM4_CS1_CS0_M 0x180U  // Comparator Filter Structure (SincFast/1/2/3)
#define SDFM_SDCPARM4_MFIE      0x200U  // Modulator Failure Interrupt enable
#define SDFM_SDCPARM4_HZEN      0x400U  // High level (Z) Threshold crossing output enable
#define SDFM_SDCPARM4_CEN       0x2000U // Comparator Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDDATA4 register
//
//*************************************************************************************************
#define SDFM_SDDATA4_DATA16_S   0U
#define SDFM_SDDATA4_DATA16_M   0xFFFFU // Lo-order 16b in 32b mode
#define SDFM_SDDATA4_DATA32HI_S 16U
#define SDFM_SDDATA4_DATA32HI_M \
    0xFFFF0000U // Hi-order 16b in 32b mode, 16-bit Data in 16b
                // mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDDATFIFO4 register
//
//*************************************************************************************************
#define SDFM_SDDATFIFO4_DATA16_S   0U
#define SDFM_SDDATFIFO4_DATA16_M   0xFFFFU // Lo-order 16b in 32b mode
#define SDFM_SDDATFIFO4_DATA32HI_S 16U
#define SDFM_SDDATFIFO4_DATA32HI_M \
    0xFFFF0000U // Hi-order 16b in 32b mode, 16-bit Data in 16b
                // mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCMPHZ4 register
//
//*************************************************************************************************
#define SDFM_SDCMPHZ4_HLTZ_S 0U
#define SDFM_SDCMPHZ4_HLTZ_M \
    0x7FFFU // High-level threshold (Z) for the comparator filter
            // output

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDFIFOCTL4 register
//
//*************************************************************************************************
#define SDFM_SDFIFOCTL4_SDFFIL_S 0U
#define SDFM_SDFIFOCTL4_SDFFIL_M 0x1FU // SDFIFO Interrupt Level
#define SDFM_SDFIFOCTL4_SDFFST_S 6U
#define SDFM_SDFIFOCTL4_SDFFST_M 0x7C0U  // SDFIFO Status
#define SDFM_SDFIFOCTL4_FFIEN    0x1000U // SDFIFO data ready Interrupt Enable
#define SDFM_SDFIFOCTL4_FFEN     0x2000U // SDFIFO Enable
#define SDFM_SDFIFOCTL4_DRINTSEL 0x4000U // Data-Ready Interrupt Source Select
#define SDFM_SDFIFOCTL4_OVFIEN   0x8000U // SDFIFO Overflow interrupt enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDSYNC4 register
//
//*************************************************************************************************
#define SDFM_SDSYNC4_SYNCSEL_S   0U
#define SDFM_SDSYNC4_SYNCSEL_M   0x3FU  // SDSYNC Source Select
#define SDFM_SDSYNC4_WTSYNCEN    0x40U  // Wait-for-Sync Enable
#define SDFM_SDSYNC4_WTSYNFLG    0x80U  // Wait-for-Sync Flag
#define SDFM_SDSYNC4_WTSYNCLR    0x100U // Wait-for-Sync Flag Clear
#define SDFM_SDSYNC4_FFSYNCCLREN 0x200U // FIFO Clear-on-SDSYNC Enable
#define SDFM_SDSYNC4_WTSCLREN    0x400U // WTSYNFLG Clear-on-FIFOINT Enable

#endif
